# SiteRegionOptionConflict Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..SiteRegionOptionConflict Property
BuiltInFailures..::..SiteFailures Class See Also
---
Subregions must be in the same Design Option as their Toposurface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SiteRegionOptionConflict { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SiteRegionOptionConflict As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SiteRegionOptionConflict {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace